Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAG176.atdf
         <register caption="ADC14 Output Data Register" name="ADCDATA14" offset="0xa38" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC15 Output Data Register" name="ADCDATA15" offset="0xa3c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC16 Output Data Register" name="ADCDATA16" offset="0xa40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC17 Output Data Register" name="ADCDATA17" offset="0xa44" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC18 Output Data Register" name="ADCDATA18" offset="0xa48" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC19 Output Data Register" name="ADCDATA19" offset="0xa4c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC20 Output Data Register" name="ADCDATA20" offset="0xa50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC21 Output Data Register" name="ADCDATA21" offset="0xa54" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC22 Output Data Register" name="ADCDATA22" offset="0xa58" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC23 Output Data Register" name="ADCDATA23" offset="0xa5c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC24 Output Data Register" name="ADCDATA24" offset="0xa60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC25 Output Data Register" name="ADCDATA25" offset="0xa64" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC26 Output Data Register" name="ADCDATA26" offset="0xa68" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC27 Output Data Register" name="ADCDATA27" offset="0xa6c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC28 Output Data Register" name="ADCDATA28" offset="0xa70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC29 Output Data Register" name="ADCDATA29" offset="0xa74" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC30 Output Data Register" name="ADCDATA30" offset="0xa78" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC31 Output Data Register" name="ADCDATA31" offset="0xa7c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC32 Output Data Register" name="ADCDATA32" offset="0xa80" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC33 Output Data Register" name="ADCDATA33" offset="0xa84" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC34 Output Data Register" name="ADCDATA34" offset="0xa88" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC35 Output Data Register" name="ADCDATA35" offset="0xa8c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC36 Output Data Register" name="ADCDATA36" offset="0xa90" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC37 Output Data Register" name="ADCDATA37" offset="0xa94" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC38 Output Data Register" name="ADCDATA38" offset="0xa98" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC39 Output Data Register" name="ADCDATA39" offset="0xa9c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC40 Output Data Register" name="ADCDATA40" offset="0xaa0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC41 Output Data Register" name="ADCDATA41" offset="0xaa4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC42 Output Data Register" name="ADCDATA42" offset="0xaa8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="ADC43 Output Data Register" name="ADCDATA43" offset="0xaac" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
      </register-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
         <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected (TRGSRCx in the ADCTRGx register)" name="" value="0x1" />
         <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected (TRGSRCx in the ADCTRGx register)" name="" value="0x0" />
      </value-group>
