Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAG176.atdf
      <value-group caption="Deadman Timer Time-out Flag bit" name="RNMICON__DMTO">
         <value caption="DMT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="" value="0x1" />
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01461" name="CTMU" version="1">
      <register-group name="CTMU">
         <register caption="CTMU Control Register" name="CTMUCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Current Range Select bits" mask="0x00000003" name="IRNG" values="CTMUCON__IRNG" />
            <bitfield caption="Current Source Trim bits" mask="0x000000FC" name="ITRIM" values="CTMUCON__ITRIM" />
            <bitfield caption="Trigger Control bit" mask="0x00000100" name="CTTRIG" values="CTMUCON__CTTRIG" />
            <bitfield caption="Analog Current Source Control bit" mask="0x00000200" name="IDISSEN" values="CTMUCON__IDISSEN" />
            <bitfield caption="Edge Sequence Enable bit" mask="0x00000400" name="EDGSEQEN" values="CTMUCON__EDGSEQEN" />
            <bitfield caption="Edge Enable bit" mask="0x00000800" name="EDGEN" values="CTMUCON__EDGEN" />
            <bitfield caption="Time Generation Enable bit" mask="0x00001000" name="TGEN" values="CTMUCON__TGEN" />
            <bitfield caption="Stop-in-Idle Mode bit" mask="0x00002000" name="CTMUSIDL" values="CTMUCON__CTMUSIDL" />
            <bitfield caption="ON Enable bit" mask="0x00008000" name="ON" values="CTMUCON__ON" />
            <bitfield caption="Edge 2 Source Select bits" mask="0x000F0000" name="EDG2SEL" values="CTMUCON__EDG2SEL" />
            <bitfield caption="Edge 2 Polarity Select bit" mask="0x00400000" name="EDG2POL" values="CTMUCON__EDG2POL" />
            <bitfield caption="Edge2 Edge Sampling Select bit" mask="0x00800000" name="EDG2MOD" values="CTMUCON__EDG2MOD" />
            <bitfield caption="Edge1 Status bit" mask="0x01000000" name="EDG1STAT" values="CTMUCON__EDG1STAT" />
            <bitfield caption="Edge2 Status bit" mask="0x02000000" name="EDG2STAT" values="CTMUCON__EDG2STAT" />
            <bitfield caption="Edge 1 Source Select bits" mask="0x3C000000" name="EDG1SEL" values="CTMUCON__EDG1SEL" />
            <bitfield caption="Edge 1 Polarity Select bit" mask="0x40000000" name="EDG1POL" values="CTMUCON__EDG1POL" />
            <bitfield caption="Edge1 Edge Sampling Select bit" mask="0x80000000" name="EDG1MOD" values="CTMUCON__EDG1MOD" />
         </register>
      </register-group>
      <value-group caption="Current Range Select bits" name="CTMUCON__IRNG">
         <value caption="100 times base current" name="" value="0x3" />
         <value caption="10 times base current" name="" value="0x2" />
         <value caption="Base current level" name="" value="0x1" />
         <value caption="1000 times base current(4)" name="" value="0x0" />
      </value-group>
      <value-group caption="Current Source Trim bits" name="CTMUCON__ITRIM">
         <value caption="Maximum positive change from nominal current" name="" value="0x1f" />
         <value caption="" name="" value="0x1e" />
         <value caption="Minimum positive change from nominal current" name="" value="0x1" />
         <value caption="Nominal current output specified by IRNG" name="" value="0x0" />
         <value caption="Minimum negative change from nominal current" name="" value="0x3f" />
         <value caption="" name="" value="0x22" />
         <value caption="Maximum negative change from nominal current" name="" value="0x21" />
      </value-group>
      <value-group caption="Trigger Control bit" name="CTMUCON__CTTRIG">
         <value caption="Trigger output is enabled" name="" value="0x1" />
         <value caption="Trigger output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Current Source Control bit" name="CTMUCON__IDISSEN">
         <value caption="Analog current source output is grounded" name="" value="0x1" />
         <value caption="Analog current source output is not grounded" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge Sequence Enable bit" name="CTMUCON__EDGSEQEN">
         <value caption="Edge1 must occur before Edge2 can occur" name="" value="0x1" />
         <value caption="No edge sequence is needed" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge Enable bit" name="CTMUCON__EDGEN">
         <value caption="Edges are not blocked" name="" value="0x1" />
         <value caption="Edges are blocked" name="" value="0x0" />
      </value-group>
      <value-group caption="Time Generation Enable bit" name="CTMUCON__TGEN">
         <value caption="Enables edge delay generation" name="" value="0x1" />
         <value caption="Disables edge delay generation" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop-in-Idle Mode bit" name="CTMUCON__CTMUSIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ON Enable bit" name="CTMUCON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 2 Source Select bits" name="CTMUCON__EDG2SEL">
         <value caption="Reserved" name="" value="0x3c" />
         <value caption="C2OUT pin is selected" name="" value="0x38" />
         <value caption="C1OUT pin is selected" name="" value="0x34" />
         <value caption="PBCLK3" name="" value="0x30" />
         <value caption="IC5 Capture Event is selected" name="" value="0x2c" />
         <value caption="IC4 Capture Event is selected" name="" value="0x28" />
         <value caption="IC3 Capture Event is selected" name="" value="0x24" />
         <value caption="IC2 Capture Event is selected" name="" value="0x20" />
         <value caption="IC1 Capture Event is selected" name="" value="0x1c" />
         <value caption="OC4 Capture Event is selected" name="" value="0x18" />
         <value caption="OC3 Capture Event is selected" name="" value="0x14" />
         <value caption="OC2 Capture Event is selected" name="" value="0x10" />
         <value caption="CTED1 pin is selected" name="" value="0xc" />
         <value caption="CTED2 pin is selected" name="" value="0x8" />
         <value caption="OC1 Compare Event is selected" name="" value="0x4" />
         <value caption="Timer1 Event is selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 2 Polarity Select bit" name="CTMUCON__EDG2POL">
         <value caption="Edge2 programmed for a positive edge response" name="" value="0x1" />
         <value caption="Edge2 programmed for a negative edge response" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge2 Edge Sampling Select bit" name="CTMUCON__EDG2MOD">
         <value caption="Input is edge-sensitive" name="" value="0x1" />
         <value caption="Input is level-sensitive" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge1 Status bit" name="CTMUCON__EDG1STAT">
         <value caption="Edge1 has occurred" name="" value="0x1" />
         <value caption="Edge1 has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge2 Status bit" name="CTMUCON__EDG2STAT">
         <value caption="Edge2 has occurred" name="" value="0x1" />
         <value caption="Edge2 has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge 1 Source Select bits" name="CTMUCON__EDG1SEL">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="C2OUT pin is selected" name="" value="0xe" />
         <value caption="C1OUT pin is selected" name="" value="0xd" />
         <value caption="IC6 Capture Event is selected" name="" value="0xc" />
         <value caption="IC5 Capture Event is selected" name="" value="0xb" />
         <value caption="IC4 Capture Event is selected" name="" value="0xa" />
         <value caption="IC3 Capture Event is selected" name="" value="0x9" />
         <value caption="IC2 Capture Event is selected" name="" value="0x8" />
         <value caption="IC1 Capture Event is selected" name="" value="0x7" />
         <value caption="OC4 Capture Event is selected" name="" value="0x6" />
         <value caption="OC3 Capture Event is selected" name="" value="0x5" />
         <value caption="OC2 Capture Event is selected" name="" value="0x4" />
         <value caption="CTED1 pin is selected" name="" value="0x3" />
         <value caption="CTED2 pin is selected" name="" value="0x2" />
         <value caption="OC1 Compare Event is selected" name="" value="0x1" />
         <value caption="Timer1 Event is selected" name="" value="0x0" />
      </value-group>
